# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [2]:
# 記得先 Import 正確的套件

import numpy as np
import pandas as pd

In [3]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [4]:
print ('1-1st:\n',df.groupby('animal').age.mean(),'\n')#groupby 

print ('1-2nd:\n',df.sort_values(by=['age']),'\n')

print('1-3rd:\n', df.sort_values(by=['visits'], ascending = False),'\n')

print('1-4th:\n', df.replace(['yes','no'],['True','False']))

1-1st:
 animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

1-2nd:
   animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes

1-3rd:
   animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no
c  snake  0.5       2       no
e    dog  5.0       2       no
i    dog  7.0       2       no
a    cat  2.5       1      yes
g  snake  4.5       1       no
h    cat  NaN       1      yes
j    dog  3.0       1       no

1-4th:
   animal  age  visits priority
a    cat  2.5       1     True
b    cat  3.0       3     True
c  snake  0.5       2    False
d    dog  NaN       3     True
e    dog  5.0       2    False
f    cat  2.0       3    False
g  snake  4.5       1    False
h    cat  NaN       1     True
i    dog  7.0       2    False
j    dog  3.0       1    False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [15]:
df1 = pd.DataFrame(np.random.random(size=(5, 3)))
df1

          0         1         2
0  0.916994  0.791052  0.406913
1  0.630956  0.210030  0.091886
2  0.035179  0.147311  0.911513
3  0.163596  0.462166  0.637244
4  0.175322  0.184985  0.575713

In [16]:
df1 -df1.mean()

          0         1         2
0  0.532584  0.431943 -0.117741
1  0.246547 -0.149079 -0.432768
2 -0.349230 -0.211798  0.386859
3 -0.220813  0.103057  0.112590
4 -0.209088 -0.174124  0.051060

In [18]:
df1.sub(df.mean(axis=1), axis=0) #sub means df1 - (df1.mean of each rows) to each columns

          0         1         2
0  0.389011  0.263069 -0.121070
1  0.152130 -0.268796 -0.386940
2 -0.323058 -0.210926  0.553276
3 -0.435819 -0.137249  0.037829
4 -0.605990 -0.596327 -0.205598

In [25]:
dfx= pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=['A','B','C'])
dfx.mean(axis=1)

dfx.sub(dfx.mean(axis=1),axis=0)

     0    1    2
A -1.0  0.0  1.0
B -1.0  0.0  1.0
C -1.0  0.0  1.0

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [28]:
df

          0         1         2
0  0.237838  0.975102  0.371010
1  0.280508  0.574801  0.581169
2  0.698020  0.084491  0.292200
3  0.955712  0.627426  0.215108
4  0.695559  0.969009  0.679368

In [36]:
print('the maxium sum at row',df.sum().argmax())

the maxium sum at row 1

In [38]:
print('the maxium sum at columns',df.sum(axis=1).argmax())

the maxium sum at columns 4